[
  {
    "title": "Full Stack - Software Engineer (L5) - Platform Engineering",
    "company": "Netflix",
    "description": "Netflix is one of the world's leading entertainment services, with 283 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nNetflix has been on the leading edge of the cloud since beginning the migration to AWS 15 years ago and runs one of the largest Cloud footprints around. The Cloud Engineering organization exists to manage that massive scale, constantly innovating to increase fleet-wide agility, efficiency, and reliability of the Netflix cloud infrastructure, while solving scale problems that we are the first to ever hit. We build, operate, and maintain Compute, Network, and Storage services so that developers at Netflix can rely on foundational building blocks when entertaining hundreds of millions of customers around the world. Join us as we push the boundaries of performance and resilience, empowering developers to create groundbreaking applications on a reliable platform.\n\nWe are looking to add new stunning colleagues to the organization, driving the transformation of how most Netflix engineers set up, change, or otherwise interact with their service infrastructure. You will partner across teams and functions to drive the next evolutionary stage of some of our most beloved and used UIs, like Spinnaker. Your work will enable us to evolve blueprints of highly efficient and fast-to-iterate services tailored to various product areas within the company, abstracting our developers from the nuances of the underlying infrastructure.\n\nMust-have Skills\n\n• Broad UI development experience - from jQuery to React\n• Awareness of time-tested UX guidelines (classics like Macintosh Human Interface Guidelines)\n• Track record of shipping domain-specific UIs for Developers\n• Ability to work across the stack, i.e. writing RESTful/GraphQL services in Java or Go\n\nWhat You’ll Be Doing In This Role\n\n• Refactoring, modularizing, and re-platforming existing UIs for infrastructure management used by Netflix engineers today\n• Building out brand-new infrastructure experiences that allow consistent, consolidated, pluggable configuration\n• Closely partnering with teams in the organization contributing to underlying services and APIs\n• Engaging directly with end engineering users to understand their needs and improve their experience\n\nYou Will Be Successful In The Role If\n\n• You love building for Developers and are passionate about the domain of Software Delivery &amp; Infrastructure Management (think Cloud Consoles) and have prior experience with things like VSCode plugins, Chromium UI, or similar\n• You enjoy getting stuff done in the face of ambiguity by iterating and shortening the feedback loop\n• You take ownership of outcomes, have a value mindset, and are motivated by impact\n• You’ve read about Netflix’s culture and think you would thrive here.\n\nHere are a few recent talks and posts from members of the team to highlight the work we do:\n\n• Keeping Netflix Reliable Using Prioritized Load Shedding\n• How Netflix uses eBPF Flow logs\n• NATless IPv6/IPv4 Address Translation\n• Consistent caching mechanisms in Titus Gateway\n• Netflix Drive \n• Zero Configuration Service Mesh with On-Demand Cluster Discovery\n\nOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nInclusion is a Netflix value and we strive to host a meaningful interview experience for all candidates. If you want an accommodation/adjustment for a disability or any other reason during the hiring process, please send a request to your recruiting partner.\n\nWe are an equal-opportunity employer and celebrate diversity, recognizing that diversity builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.",
    "location": "Los Gatos, CA",
    "date_posted": "2025-02-20"
  },
  {
    "title": "Junior Front-End Developer",
    "company": "United Wheels Inc.",
    "description": "Overview Of The Company\n\nUnited Wheels Inc. (“UWI”) is an international, privately held business, with affiliated companies and operations in Asia, the Americas and around the world. UWI is a world leader in the design, manufacture and international distribution of bicycles, e-bikes, and rideable toys, manufacturing more than 6 million bicycles and e-Bikes each year. In additional to cycling, UWI is at the forefront of materials science though Allite Inc. and its affiliated companies, which utilizes its proprietary magnesium alloys across numerous industries (e.g., sporting goods, robotics, electronics, aerospace, etc.).\n\nUWI owns and operates several bicycle-related subsidiaries. These subsidiaries include:\n\n• Huffy Corp. (https://www.huffybikes.com/), the iconic bicycling company based in Dayton, Ohio, with more than 125+ years of bicycling history. \n• Buzz Bicycles (https//.buzzbicycles.com)\n• Batch Outdoors Inc. (https://www.batchbicycles.com/)\n• Niner Brands International Inc. (https://ninerbikes.com/)\n• VAAST Bicycles, (a division of Allite Inc.) (https://www.vaastbikes.com/)\n\nOverview:\n\nDo you have a passion for web design, user experience, a keen understanding of front-end technologies, and the ability to work independently with minimal supervision? As a Junior Front-End Developer, you'll be responsible for creating and maintaining websites that inspire and delight.\n\nResponsibilities:\n\n• Craft delightful and functional responsive websites using HTML, CSS, PHP, and JavaScript\n• Partner with our design and marketing team to bring their visions to life\n• Write code that's clean, maintainable, and efficient\n• Troubleshoot, UAT and debug any issues that arise with the website\n• Stay on top of the latest and greatest advancements in web development\n• Keep our website content fresh and up-to-date\n• Ensure that our website is accessible and usable for everyone\n• Work closely with other developers and teams to resolve technical challenges\n• Ability to work independently with a minimum of supervision\n\nRequirements:\n\n• Minimum Associate degree in Computer Science, Web Design, Interactive Multimedia, or a related field\n• 1-3 years of experience in web design and front-end technologies\n• Strong understanding of HTML, PHP, CSS, and JavaScript\n• Experience with Tailwind CSS\n• Proficiency in using Figma Dev mode\n• Experience with responsive design and cross-browser compatibility, and deployment testing\n• Familiarity with version control (e.g. Git)\n• Understanding of web standards and accessibility guidelines\n• Excellent problem-solving and critical-thinking skills\n• Strong communication and teamwork skills\n\nCompetencies\n\n• Customer Focus - Aims to satisfy all customers while maintaining effective relationships, both internal and external. Maximizes those relationships to improve personal, department, and organizational performance. Holds co-workers and customers to a similar standard. \n• Energy - Have a tremendous amount of energy and passion for our people, products, and brands. Approaches each date willing to take on the day’s challenges. Operating at their individual peak performance without encouragement. \n• Energize - Energize teams with enthusiasm and excitement without intimidating them. Projects a positive mental attitude and can-do spirit, who lifts members of his / her team. Does not get discouraged by setbacks. \n• Edge - Have a competitive edge and an overwhelming desire to win. Hates losing and will give 100% commitment to achieving or exceeding their plan. Willing to make difficult decisions, when called upon. \n• Execution - Action and performance oriented and focused on attaining results. A team player who is reliable and follows through on tasks to completion. Attention to details. \n• Increases Company Value - Strives to increase sales, reduce costs, improve efficiency, and maximize profits to increase the value of the Company.\n• Innovative / Continuous Improvement - Committed to improving processes, products, services, and a willingness to embrace change for the benefit of our team, department, organization, and shareholders. \n• Integrity - The quality of being honest and having strong moral principles; moral uprightness. Elevating challenges to collaborate with co-workers, SLT, ELT, and the Board.",
    "location": "Miamisburg, OH",
    "date_posted": "2025-03-13"
  },
  {
    "title": "Frontend Developer",
    "company": "Adapty.io",
    "description": "Adapty is a revenue management platform for mobile apps that simplifies subscription implementation and paywall management. We help developers quickly monetize their apps, serving 8,000+ apps and processing $1.4 billion in in-app subscriptions annually. Backed by top investors like 500 Startups and Surface Ventures.\n\nYou’ll be part of the technical team, which is responsible for the infrastructure, scalability, and reliability of our platform. This team ensures our technology is robust, secure, and innovative, allowing us to deliver a seamless experience to our customers.\n\nWhat You Will Do\n\n• Develop and enhance business logic in a complex frontend application.\n• Write and maintain integration tests to ensure code quality.\n• Refactor and develop code for a new architecture while optimizing performance.\n• Create and refine reusable components for our internal UI Kit.\n• Transition pages from the old API to the new API, ensuring smooth data integration.\n• Work extensively with tables, charts, and forms to optimize data presentation.\n• Participate in task assessment, decomposition, and technical discussions.\n• Maintain and improve development processes, including CI/CD, code reviews, and GitFlow.\n\nWhat We Expect\n\n• 3+ years of professional experience in frontend development, with a strong focus on React.\n• Proficiency in TypeScript.\n• Experience with testing frameworks such as Jest, React Testing Library, and MSW.\n• Strong understanding of state management libraries like Zustand and React-Query.\n• Experience working with tables (react-table) and chart components (visx).\n• Familiarity with monorepo management using Lerna.\n• Excellent communication and problem-solving skills.\n\nNice to Have\n\n• Knowledge of feature-slice architecture.\n• Experience with containerization technologies like Docker.\n\nWhat We Offer\n\n• Flexible Remote Work: Work from anywhere with a schedule that fits your life. While our core team operates in Europe, we are open to candidates from other regions (we use deel.com for global hiring).\n• Perfect Product Fit: Our product aligns perfectly with the market, making it effortless to sell, easy to promote, and a joy for customers to use.\n• Direct Communication: We keep things simple and transparent, ensuring you focus on what matters most—getting things done.\n• Fast-Track Impact: Get quick and clear feedback on your work from the market. Join us as we break into the US market and expand into other exciting opportunities.\n• Additional Benefits: We support your professional and personal growth with free English lessons, sports and laptop reimbursements.\n\nShare This Job\n\nJob Information\n\nDepartment\n\nFrontend Development\n\nLocation\n\nRemote\n\nEmployee Type\n\nFull-time\n\nApply for a job now",
    "location": "United States",
    "date_posted": "2025-03-07"
  },
  {
    "title": "Software Engineer (Full-Stack)",
    "company": "Paces",
    "description": "In the next 30 years, the world will transform every part of the built environment to be climate positive green infrastructure. Knowing what, where, and how to build infrastructure like solar farms is one of the great opportunities of our time. However, there are problems!\n\nThe Problem\n\n80% of clean energy projects developers start never actually get built because most projects are started without deep due diligence on zoning and interconnection due to the cost of collecting that data. This means $17B worth of canceled projects per year.\n\nOur Solution\n\nPaces is software for green infrastructure developers to identify the best places to build and manage their projects. First we collect environmental, permitting, zoning, energy grid data from various different sources; then we analyze the data and use AI to identify the best places for developers to build their next projects.\n\nOur Team\n\nWe are building a team where people can proudly say their time at Paces was the most impactful, meaningful work of their career. Our amazing team in Brooklyn, New York includes incredible engineers and growth team members from companies like AWS, Meta AI, Deepmind, Replica, Yotpo, Rent The Runway &amp; Leap.\n\nPaces is growing rapidly and looking for exceptional people to join who want to have a massive positive climate impact while building a great culture! We are looking for a scrappy and customer centric full-stack engineer to join us as we scale up. You will have the chance to build things from ground up and own a large portion of the tech stack.\n\n🏆 What You’ll Achieve\n\n• Lead development on large scale projects, collaborate closely with the product and engineering team\n• Optimize speed and scalability of our data heavy platform\n• Conduct user researches, iterate with users, improve user experience and identify new opportunities\n• Collaborate closely with our CTO and team to directly impact product roadmap\n\n📈 Requirements\n\n• Proficient with React, JavaScript / TypesScript\n• Proficient with Python\n• You are a proactive and fast learner and able to pick up new things quickly\n• You genuinely want to build something people want, enjoy talking to users and learning their needs\n\n✨ About You\n\nYou will thrive in our culture if you:\n\n• Have a strong bias towards action and prioritize execution\n• Share our passion to build something that fights climate change\n• Easily handle the unstructured environment of fast moving startups\n• Have the hunger to grow together with Paces as we scale up\n\n🚀 Bonus Points\n\n• Previous experience at a high-growth, fast-paced startup\n• Previous experience with map frameworks, such as Leaflet.js, Mapbox, and Google Maps\n• Previous experience scaling up data intensive, AI and analytics heavy solutions\n• Previous experience building and deploying on AWS\n\n💰 Compensation And Benefits\n\n• 150K - 200K annual compensation\n• Competitive equity compensation\n• 401(k) matching\n• Health, Dental and Vision insurance\n• Hybrid working in the office 2-4 times per week",
    "location": "New York, NY",
    "date_posted": "2025-01-24"
  },
  {
    "title": "Web Front-End Developer",
    "company": "",
    "description": "We are Lenovo. We do what we say. We own what we do. We WOW our customers.\n\nLenovo is a US$57 billion revenue global technology powerhouse, ranked #248 in the Fortune Global 500, and serving millions of customers every day in 180 markets. Focused on a bold vision to deliver Smarter Technology for All, Lenovo has built on its success as the world’s largest PC company with a full-stack portfolio of AI-enabled, AI-ready, and AI-optimized devices (PCs, workstations, smartphones, tablets), infrastructure (server, storage, edge, high performance computing and software defined infrastructure), software, solutions, and services. Lenovo’s continued investment in world-changing innovation is building a more equitable, trustworthy, and smarter future for everyone, everywhere. Lenovo is listed on the Hong Kong stock exchange under Lenovo Group Limited (HKSE: 992) (ADR: LNVGY).\n\nThis transformation together with Lenovo’s world-changing innovation is building a more inclusive, trustworthy, and smarter future for everyone, everywhere. To find out more visit www.lenovo.com, and read about the latest news via our StoryHub.\n\n• This is a fully remote role, with the ideal candidate in EST time zone.***\n\nJob Description\n\nWe are seeking a talented Web Front-End Developer / UX Designer to design and develop dynamic, interactive, and intuitive user interfaces for Agentic AI applications. In this role, you will collaborate with AI engineers and backend developers to create seamless front-end experiences that enhance the functionality of AI-driven agents. Your work will directly impact how users interact with autonomous AI systems, ensuring usability, efficiency, and scalability.\n\nResponsibilities\n\n• Design and develop responsive, high-performance front-end interfaces for AI-driven applications.\n• Implement and optimize UI/UX components that enhance user interaction with Agentic AI systems.\n• Collaborate with AI and backend teams to integrate APIs, real-time data, and AI-generated outputs.\n• Ensure applications are scalable, secure, and performant across different devices and browsers.\n• Stay up to date with emerging front-end technologies, AI advancements, and best practices.\n• Conduct testing, debugging, and performance tuning for optimal user experience.\n• Work closely with product managers and designers to translate requirements into functional applications.\n\nRequired Qualifications\n\n• 3+ years of experience in front-end development using React, Vue, Angular or similar Front-end development tools.\n• Strong proficiency in HTML, CSS, JavaScript, and TypeScript.\n• Experience integrating with AI/ML-driven APIs, WebSockets, and real-time data sources.\n• Familiarity with state management libraries (Redux, Zustand, Pinia, etc.).\n• Knowledge of UI/UX best practices and designing for AI-powered user interfaces.\n• Understanding of RESTful APIs, GraphQL, and backend communication.\n• Experience with performance optimization, accessibility standards, and responsive design.\n• Experience displaying pages of data in readable, searchable form.\n• Experience building user input screens.\n\nPreferred Requirements\n\n• Familiarity with LLMs, AI agents, and conversational UI frameworks.\n• Experience with WebAssembly, WebRTC, or other cutting-edge web technologies.\n• Knowledge of prompt engineering and AI-driven UI/UX patterns.\n• Experience with WebGL, interactive data visualization, or AI-driven UI elements.\n\nThe base salary range budgeted for this position in CA, CO, Jersey City - NJ, NV, Ithaca - NY, NYC, WA, is $90k - $110k. Individuals may also be considered for bonus and/or commission. Lenovo’s various benefits can be found here: https://www.lenovobenefits.com/enrolling-in-benefits/why-join-lenovo/\n\nIn compliance with Colorado's EPEWA, the expected Application Deadline for this position is 4/11/25. This applies to internal and external candidates.\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, religion, sexual orientation, gender identity, national origin, status as a veteran, and basis of disability or any federal, state, or local protected class.",
    "location": "Morrisville, NC",
    "date_posted": "2025-03-06"
  }
]