[
  {
    "title": "Front-End Web Developer",
    "company": "Miami HEAT",
    "description": "Do you want to work for a Championship organization? We have the job for you! The Miami HEAT marketing department is looking to hire an Entry entry-level front-end Developer who has a foundational understanding of Next.js, React.js, WordPress, and front-end development. As a Front-End Developer you will be responsible for updating KaseyaCenter.com with new events and assisting the Web Manager/Developer with HEAT.com by updating content, developing webpages, and assuring our websites are ADA compliant.\n\nEssential Duties &amp; Responsibilities\n\nESSENTIAL FUNCTIONS: The following are examples of the various functions required. The job requirements are not limited to the items on this list:\n\n• Update content on HEAT.com &amp; KaseyaCenter.com\n• Develop webpages and new user-facing features\n• Build reusable code for future use\n• Testing and debugging site code\n• Assessing web performance\n• Help ensure websites are accessible and ADA-compliant.\n• Work closely with other teams and handle additional responsibilities as directed by the Web Manager/Developer\n\nDesired Qualifications\n\nTo perform this job successfully, an individual must be able to perform each essential duty. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform essential functions.\n\nEducation And/or Experience\n\n• Solid grasp of NBA basketball and Miami HEAT history\n• Bachelor’s degree or equivalent experience in Computer Science or a related field\n• 2-3 years of front-end web development experience\n• Proficient understanding of web markup, including HTML5, CSS3\n• Proficient understanding of client-side scripting such as JavaScript frameworks, including Next.js and React\n• Proficient understanding of adaptable web development and frameworks, such as TailwindCSS\n• Proficient understanding of WordPress CMS\n• Proficient experience with Git &amp; Bitbucket\n• Workaround cross-browser compatibility issues\n• Testing and debugging websites\n• Server-side CSS pre-processing platforms, such as SASS\n• Content Management Systems such as WordPress and Drupal\n• Familiarity with tools such as Photoshop, Illustrator, or Figma to be able to crop, resize, or perform small adjustments on a design\n• Website accessibility and ADA compliance.\n• SEO principles\n• Asynchronous request handling, partial page updates, AJAX and APIs.\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender/gender identity, age, disability, marital status, sexual orientation, pregnancy, genetic information, national origin, citizenship status, veteran status, and any other legally protected status entitled to protection under federal, state, or local anti-discrimination laws. EOE &amp; DFWP."
  },
  {
    "title": "Software Engineer (Full-Stack)",
    "company": "Paces",
    "description": "In the next 30 years, the world will transform every part of the built environment to be climate positive green infrastructure. Knowing what, where, and how to build infrastructure like solar farms is one of the great opportunities of our time. However, there are problems!\n\nThe Problem\n\n80% of clean energy projects developers start never actually get built because most projects are started without deep due diligence on zoning and interconnection due to the cost of collecting that data. This means $17B worth of canceled projects per year.\n\nOur Solution\n\nPaces is software for green infrastructure developers to identify the best places to build and manage their projects. First we collect environmental, permitting, zoning, energy grid data from various different sources; then we analyze the data and use AI to identify the best places for developers to build their next projects.\n\nOur Team\n\nWe are building a team where people can proudly say their time at Paces was the most impactful, meaningful work of their career. Our amazing team in Brooklyn, New York includes incredible engineers and growth team members from companies like AWS, Meta AI, Deepmind, Replica, Yotpo, Rent The Runway &amp; Leap.\n\nPaces is growing rapidly and looking for exceptional people to join who want to have a massive positive climate impact while building a great culture! We are looking for a scrappy and customer centric full-stack engineer to join us as we scale up. You will have the chance to build things from ground up and own a large portion of the tech stack.\n\n🏆 What You’ll Achieve\n\n• Lead development on large scale projects, collaborate closely with the product and engineering team\n• Optimize speed and scalability of our data heavy platform\n• Conduct user researches, iterate with users, improve user experience and identify new opportunities\n• Collaborate closely with our CTO and team to directly impact product roadmap\n\n📈 Requirements\n\n• Proficient with React, JavaScript / TypesScript\n• Proficient with Python\n• You are a proactive and fast learner and able to pick up new things quickly\n• You genuinely want to build something people want, enjoy talking to users and learning their needs\n\n✨ About You\n\nYou will thrive in our culture if you:\n\n• Have a strong bias towards action and prioritize execution\n• Share our passion to build something that fights climate change\n• Easily handle the unstructured environment of fast moving startups\n• Have the hunger to grow together with Paces as we scale up\n\n🚀 Bonus Points\n\n• Previous experience at a high-growth, fast-paced startup\n• Previous experience with map frameworks, such as Leaflet.js, Mapbox, and Google Maps\n• Previous experience scaling up data intensive, AI and analytics heavy solutions\n• Previous experience building and deploying on AWS\n\n💰 Compensation And Benefits\n\n• 150K - 200K annual compensation\n• Competitive equity compensation\n• 401(k) matching\n• Health, Dental and Vision insurance\n• Hybrid working in the office 2-4 times per week"
  },
  {
    "title": "Front-End Engineer Internship – 2025 (US)",
    "company": "Amazon",
    "description": "Description\n\nAre you excited to build products that are used by Amazon customers all over the world? As a Front-End Engineer Intern, you’ll have the opportunity to work closely with experienced developers to create the user-facing side of software. You’ll collaborate with team members and stakeholders on UX and the full software development lifecycle, including scoping, software design, code, testing, documentation, deployment, and maintenance.\n\nAmazon internships are full-time positions, and interns should expect to work Monday-Friday, up to 40 hours per week typically between 8am-5pm. Specific team norms around working hours will be communicated by your manager. Interns should not have conflicts such as classes or other employment during the Amazon work-day.\n\nApplicants should have a minimum of one quarter/semester/trimester remaining in their studies after their internship concludes. By applying to this position, your application will be considered for all Front-End Engineer Internship roles at all locations we hire for in the United States including but not limited to: Greater Seattle Area (Seattle, Bellevue, Redmond), Greater Bay Area (San Francisco, Sunnyvale, Santa Clara), Greater DMV (DC, MD, VA), Austin (TX), New York City (NY), Minneapolis (MN).\n\nYou will be able to provide your preference of location and start date during the application process but, we cannot guarantee that we can meet your selection based on several factors including but not limited to the availability and business needs of this role. Finalization on the location and start dates available will be provided to you at the time of job offer.\n\nStart dates for our internships in this posting include the following periods:\n\n• Winter (Starts January/February 2025)\n• Summer (Starts May/June 2025)\n• Fall (Starts August/September 2025)\n\nKey job responsibilities\n\nAs a Front-End Engineer Intern, You Will/may\n\n• Deliver software components and improvements to software features with your team’s software.\n• Work with stakeholders and product partners to deliver high-quality UX.\n• Take feature specifications and deliver working code that is maintainable and extendable.\n• Help provide operational support for your team and work to ensure that root causes are identified and resolved.\n• Participate in code reviews and daily stand-ups.\n• Collaborate with your team to positively impact the software quality, customer experience, and maintainability of your team’s products.\n\nA day in the life\n\nIn addition to working on an impactful project, you will have the opportunity to engage with Amazonians for both personal and professional development, expand your network, and participate in fun activities with other interns throughout your internship. No matter the location of your internship, we give you the tools to own your internship and learn in a real-world setting.\n\nWe’re on the lookout for the curious, those who think big and want to define the world of tomorrow. At Amazon, you will grow into the high impact, visionary person you know you’re ready to be. Every day will be filled with exciting new challenges, developing new skills, and achieving personal growth. How often can you say that your work changes the world? At Amazon, you’ll say it often. Join us and define tomorrow.\n\nBasic Qualifications\n\n• Are 18 years of age or older\n• Experience in HTML, CSS, or JavaScript\n• Currently working towards a Bachelor’s or Master’s Degree in Computer Science, Computer Engineering, Information Science, Web Development, Human-Computer Interaction, or other equivalent discipline, with an expected conferral date between October 2025 – December 2028.\n• Proficiency in at least one object-oriented programming language (e.g., JavaScript, Python, C#).\n• Understanding of computer science fundamentals (e.g., data structures &amp; algorithms, OO design).\n\nPreferred Qualifications\n\n• Experience in one or more relevant front-end frameworks such as React, Angular, etc.\n• Knowledge of UX best practices\n• Previous technical internships in a related field (e.g., Front-End, Full Stack, Web Development).\n• Customer obsession and strong problem-solving skills.\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $47.84/hr in our lowest geographic market up to $100.48/hr in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.\n\nCompany - Amazon.com Services LLC\n\nJob ID: A2789687"
  }
]