[
  {
    "title": "Front-End Web Developer",
    "company": "Miami HEAT",
    "description": "Do you want to work for a Championship organization? We have the job for you! The Miami HEAT marketing department is looking to hire an Entry entry-level front-end Developer who has a foundational understanding of Next.js, React.js, WordPress, and front-end development. As a Front-End Developer you will be responsible for updating KaseyaCenter.com with new events and assisting the Web Manager/Developer with HEAT.com by updating content, developing webpages, and assuring our websites are ADA compliant.\n\nEssential Duties &amp; Responsibilities\n\nESSENTIAL FUNCTIONS: The following are examples of the various functions required. The job requirements are not limited to the items on this list:\n\n• Update content on HEAT.com &amp; KaseyaCenter.com\n• Develop webpages and new user-facing features\n• Build reusable code for future use\n• Testing and debugging site code\n• Assessing web performance\n• Help ensure websites are accessible and ADA-compliant.\n• Work closely with other teams and handle additional responsibilities as directed by the Web Manager/Developer\n\nDesired Qualifications\n\nTo perform this job successfully, an individual must be able to perform each essential duty. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform essential functions.\n\nEducation And/or Experience\n\n• Solid grasp of NBA basketball and Miami HEAT history\n• Bachelor’s degree or equivalent experience in Computer Science or a related field\n• 2-3 years of front-end web development experience\n• Proficient understanding of web markup, including HTML5, CSS3\n• Proficient understanding of client-side scripting such as JavaScript frameworks, including Next.js and React\n• Proficient understanding of adaptable web development and frameworks, such as TailwindCSS\n• Proficient understanding of WordPress CMS\n• Proficient experience with Git &amp; Bitbucket\n• Workaround cross-browser compatibility issues\n• Testing and debugging websites\n• Server-side CSS pre-processing platforms, such as SASS\n• Content Management Systems such as WordPress and Drupal\n• Familiarity with tools such as Photoshop, Illustrator, or Figma to be able to crop, resize, or perform small adjustments on a design\n• Website accessibility and ADA compliance.\n• SEO principles\n• Asynchronous request handling, partial page updates, AJAX and APIs.\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender/gender identity, age, disability, marital status, sexual orientation, pregnancy, genetic information, national origin, citizenship status, veteran status, and any other legally protected status entitled to protection under federal, state, or local anti-discrimination laws. EOE &amp; DFWP."
  },
  {
    "title": "Junior Node.JS Developer",
    "company": "Team Remotely",
    "description": "This is a remote position.\n\n Junior Node.JS Developer (1 year experience, remote)\n\nBe part of our future! This job posting builds our talent pool for potential future openings. We'll compare your skills and experience against both current and future needs. If there's a match, we'll contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process.\n\nHiring Type: Full-Time\n\nBase Salary: $57K-$67K Per Annum.\n\nDescription:\n\nIn this role, you will work closely with experienced developers and contribute to the design, development, and maintenance of robust and scalable applications using Node.js. This is an excellent opportunity for someone looking to kick-start their career in web development.\n\nResponsibilities:\n\n• Collaborate with the development team to gather project requirements and specifications. \n• Assist in the design, development, and maintenance of server-side applications using Node.js. \n• Learn to develop and consume RESTful APIs, integrating with third-party services. \n• Write clean and efficient code following best practices and coding standards. \n• Participate in unit testing and debugging to ensure code quality and reliability. \n• Collaborate with front-end developers to integrate server-side logic with client-side components. \n• Contribute to code reviews and actively participate in knowledge sharing. \n• Stay updated with emerging technologies and industry trends to enhance your skills and knowledge. \n• Seek guidance and support from senior team members to resolve technical issues. \n\nQualifications\n\n• Bachelor's degree in Computer Science, Software Engineering, or a related field. \n• Basic understanding of JavaScript and web technologies. \n• Familiarity with Node.js and its ecosystem. \n• Understanding of asynchronous programming and event-driven architecture. \n• Knowledge of databases and SQL. \n• Strong problem-solving and analytical skills. \n• Excellent communication and collaboration abilities. \n• Eagerness to learn and a passion for web development. \n• Ability to work both independently and in a team-oriented, collaborative environment. \n\nBenefits:\n\n• Competitive salary based on skills, qualifications, and experience. \n• Comprehensive health, dental, and vision insurance plans. \n• Paid time off and holidays. \n• Flexible work schedule and remote work options. \n• Mentorship and guidance from experienced developers. \n• Learning and growth opportunities to enhance your skills and knowledge in web development. \n• Access to resources and training programs to stay updated with emerging technologies and industry trends."
  },
  {
    "title": "Website Manager and Administrator",
    "company": "Britannia Hotels Ltd",
    "description": "Location: Manchester. M17 1JT, United Kingdom\n\nAddress: Unit 2, Tenax Road\n\nINDHP\n\nBritannia Hotels is looking for a skilled Website Manager to oversee the management and optimisation of our three main websites (Britannia Hotels, Pontins, and Elite Venue Selection) and 20+ microsites. You’ll be responsible for enhancing the digital experience, managing content, and ensuring seamless website performance. The ideal candidate will have experience in web design, SEO, and content creation, with proficiency in WordPress (Divi), Umbraco, and technical troubleshooting.\n\nKey Responsibilities\n\n• Manage and maintain three main websites and 20+ microsites, ensuring functionality and brand alignment.\n• Design and develop new web features, optimising for mobile and user experience.\n• Implement SEO best practices, monitor performance with tools like Google Analytics, and assist with keyword optimisation.\n• Create and update engaging content and visuals, ensuring consistency across platforms.\n• Troubleshoot performance issues, manage backups, plugins, and integrations.\n• Monitor website traffic and provide actionable insights for improvement.\n• Collaborate with internal teams to align digital assets with business goals.\n\nRequired Skills\n\n• Proficiency in WordPress (Divi) and Umbraco\n• Basic Photoshop skills for visual content creation\n• Solid understanding of SEO and tools like Google Search Console\n• Technical expertise in website hosting, backups, and plugin management\n• Strong problem-solving skills and attention to detail\n\nPreferred Experience\n\n• Background in hospitality or events industries\n• Familiarity with website speed optimisation and performance tracking\n• Experience managing multiple websites\n\nBenefits Include\n\n• An attractive salary\n• Career development opportunities throughout the UK\n• Significant staff discount rates when staying at one of our 60 hotels in the UK\n• 50% discount off food and drink if staying at one of our hotels\n• Friends and family hotel stay discounts\n• Reduced membership at our Leisure clubs\n• Free meals on duty (when applicable)\n• Employee referral scheme \n• Free Uniform (if applicable to your role)\n• Up to 28 days holiday including bank holidays per annum.\n• Auto enrolment pension scheme\n\nWe are an equal opportunities employer. We require all employees to provide us with evidence of their right to work in the UK. All data will be stored in accordance with our privacy policy found on our website. Strictly no agencies. No commissions or other charges will be paid in any circumstances."
  }
]